## Exercícios Titanic

Nesse exercício, o intuito é que vocês usem a base fornecida e respondam as questões abaixo. Lembrem-se: Devemos usar o pandas para isso! Caso tenha algo diferente do que vimos, busquem na documentação!

In [2]:
import numpy as np
import pandas as pd

## 1. Leia a base titanic.csv

In [8]:
leitura = pd.read_csv('titanic.csv', encoding= 'utf-8')
leitura

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

## 2. Quantos homens e quantos mulheres estavam no navio?

In [4]:
leitura = pd.read_csv('titanic.csv', encoding= 'utf-8', sep = ',', usecols = ['Sex'])

mulheres = leitura[leitura['Sex'] == 'female'].shape[0]
homens = leitura[leitura['Sex'] == 'male'].shape[0]

print(f'Mulhere: {mulheres} e Homens: {homens}')

Mulhere: 314 e Homens: 577

## 3. Qual era a média de idade dos passageiros?

In [31]:
leitura3 = pd.read_csv('titanic.csv', sep = ',', usecols = ['Age'])
soma_idade = leitura3.sum()
pax = leitura3.count()

media = soma_idade/pax


media2 = leitura3.mean()
media2

Age    29.699118
dtype: float64

## 4. Quantos passageiros sobreviveram?

In [24]:
leitura4 = pd.read_csv('titanic.csv', sep = ',')
sobreviventes = leitura4['Survived'][leitura4['Survived'] == 1].sum()
sobreviventes

342

## 5. Traga as informações do passageiro de nome "Montvila, Rev. Juozas"

In [59]:
leitura5 = pd.read_csv('titanic.csv', sep = ',')
linha = leitura5.loc[leitura5['Name'] == "Montvila, Rev. Juozas"]
linha

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0,NaN,S

## 6. (Pergunta aberta) Sobreviveram mais crianças, homens adultos ou mulheres adultas?

In [79]:
tabela = pd.read_csv('titanic.csv')
crianca = tabela['Survived'][tabela['Age'] < 19].sum()
crianca

70

In [80]:
homem_adulto = tabela['Survived'][tabela['Age'] > 18][tabela['Sex'] == 'male'].sum()
homem_adulto

69

In [82]:
mulher_adulta = tabela['Survived'][tabela['Age'] > 18][tabela['Sex'] == 'female'].sum()
mulher_adulta

151

In [ ]:
Logo, sobreviveram mais mulheres adultas